{
  "Q1": {
    "o3": {
      "stage1_cates": "Classification criteria  \nI will separate solutions according to the main mathematical “tool-kit” that drives the proof.  \nTwo solutions will stay in the same group when they both rely on the same broad strategy (e.g. “classical trigonometric identities”).  They will be put in different groups only if the core language/method is different (e.g. complex numbers, synthetic Euclidean geometry).  Variations in algebraic manipulation or in how an answer choice is checked do not constitute a new high-level category.\n\nGroups  \n\nGroup T  –  Classical trigonometric identities and angle-addition/double-angle formulas  \n• Solution 1 – Uses the tangent addition formula and inverse-tangent manipulation.  \n• Solution 2 – Evaluates the sine of β and of candidate expressions via standard trig identities.  \n• Solution 3 – Recognises 2 sin A cos A = sin 2A and converts directly to an angle relation.  \n(All three rely solely on elementary trig identities; no other major framework is invoked.)\n\nGroup C  –  Complex-number (Euler-form) argument  \n• Solution 4 – Encodes the given slopes as complex numbers, multiplies moduli/arguments and translates the argument equation into an angle statement.\n\nGroup G  –  Synthetic Euclidean geometry / cyclic quadrilaterals & Ptolemy  \n• Solution 5 – Builds a cyclic quadrilateral, applies Ptolemy’s theorem and angle chasing in the circum-circle; trigonometric computation plays no essential role.\n\nSummary of assignment  \n• Group T: Solutions 1, 2, 3  \n• Group C: Solution 4  \n• Group G: Solution 5",
      "stage2_cates": "{1: \"Solution 1, Solution 2, Solution 3\", 2: \"Solution 4\", 3: \"Solution 5\"}",
      "cats": "[1,1,1,2,3]"
    }
  },
  "Q2": {
    "o3": {
      "stage1_cates": "Classification criteria (high-level only)\n\nA.  “Expand-and-cancel” strategy  \n   The numbers are rewritten in the form (k·10ⁿ ± 1) or (10ⁿ ± k); the products are expanded with the distributive law so that the main terms cancel, leaving a small residue that is easily evaluated.\n\nB.  Modular-arithmetic strategy  \n   The numerical value is not computed directly; instead, the expression is examined modulo one or more cleverly chosen moduli to force a unique small remainder.\n\nC.  Polynomial-identity (difference-of-cubes) strategy  \n   The factors are interpreted as (x ± 1)(x² ∓ x + 1)=x³ ± 1 with the substitution x = 100, and the well-known identity x³ + 1 − (x³ − 1)=2 is applied.\n\nGrouping of the five solutions\n\nGroup A – Expand-and-cancel: Solutions 1, 2, 3  \n All three rewrite the given numbers near a power of 10, expand the products, and observe massive cancellation.\n\nGroup B – Modular arithmetic: Solution 4  \n This solution works entirely with congruences modulo 10 and modulo 101 to force the answer.\n\nGroup C – Polynomial identity (difference of cubes): Solution 5  \n Here the author sets x=100, recognises each product as x³ ± 1, and subtracts.\n\nEach solution is thus assigned to exactly one group, and no two groups share the same overarching strategy.",
      "stage2_cates": "{1: \"Solution 1, Solution 2, Solution 3\", 2: \"Solution 4\", 3: \"Solution 5\"}",
      "cats": "[1,1,1,2,3]"
    }
  },
  "Q3": {
    "o3": {
      "stage1_cates": "Classification criteria  \nTo decide whether two solutions belong in the same group, look only at the overarching idea that drives the count of swaps.\n\n1. Simulation / explicit step-by-step swapping  \n   – The author actually performs (or mentally performs) the adjacent swaps one after another and tallies them.\n\n2. Recursive/triangular-number reasoning  \n   – The author never carries out the individual swaps.  Instead, the string of length n is related to a shorter string, producing the triangular-number formula n(n−1)/2.\n\n3. Inversion-count argument from permutation theory  \n   – The answer is obtained by counting inversions of the target permutation, using the fact that “#adjacent swaps = #inversions”.\n\nSolutions placed in the same group must share the same high-level idea; differences in order of doing swaps, notation, or the inclusion of a closed formula do not constitute a new strategy.\n\nGrouping of the five solutions\n\nGroup 1 – Simulation / explicit swaps  \n• Solution 1  \n• Solution 4  \n(Both physically move each letter through its neighbors, adding 5+4+3+2+1 swaps.)\n\nGroup 2 – Recursive / triangular-number reasoning  \n• Solution 2  \n• Solution 3  \n(Both argue that changing a string of length n reduces to changing one of length n−1, yielding the triangular sequence 0,1,3,6,… and thus 15 for n=6.)\n\nGroup 3 – Inversion-count argument  \n• Solution 5  \n(Counts the 15 inversions of 654321 relative to 123456, using the permutation fact directly.)\n\nEvery solution belongs to exactly one group, and the groups reflect completely distinct high-level strategies.",
      "stage2_cates": "{1: \"Solution 1, Solution 4\", 2: \"Solution 2, Solution 3\", 3: \"Solution 5\"}",
      "cats": "[1,2,2,1,3]"
    }
  },
  "Q4": {
    "o3": {
      "stage1_cates": "Classification criteria  \nTo decide whether two solutions belong to the same group, we look only at the chief idea that drives the computation.  \n• Group together solutions whose primary strategy is the same algebraic approach (e.g. turning the system into factorizations, then doing integer-factor casework).  \n• Put a solution in a different group if it reaches the answer by a fundamentally different global tactic (e.g. exploiting the multiple-choice format instead of solving the system).  \nMinor differences in how the casework is organised, how many auxiliary equations are written, or what order steps are taken are ignored.\n\nGrouping of the five solutions\n\nGroup 1 – Algebraic factorisation of summed / differenced equations  \nCore idea: Add and/or subtract the given equations to obtain products such as  \n (a + c)(b + 1) = 187, (a − c)(b − 1) = 13, …  \nThen use the fact that the unknowns are integers to analyse the limited set of factor pairs, do short casework, and finally compute ab + bc + ca.\n\n• Solution 1  \n• Solution 2  \n• Solution 3  \n• Solution 4  \n\nAll four follow exactly this pathway; differences are only in the amount of casework or which two equations they combine first.\n\nGroup 2 – Multiple-choice elimination / bounding without fully solving the system  \nCore idea: Express the desired quantity in terms of a + b + c, use each answer choice to deduce a value for a + b + c, and discard choices that immediately contradict easy bounds or trial substitutions, until only one choice remains.\n\n• Solution 5  \n\nSummary  \nGroup 1: Solutions 1, 2, 3, 4 – same algebraic-factorisation method.  \nGroup 2: Solution 5 – answer-choice elimination approach.",
      "stage2_cates": "{1: \"Solution 1, Solution 2, Solution 3, Solution 4\", 2: \"Solution 5\"}",
      "cats": "[1,1,1,1,2]"
    }
  },
  "Q5": {
    "o3": {
      "stage1_cates": "Classification criteria  \nAt the very top level a solution can proceed in essentially two different ways.\n\n1. “Complement-and-configuration’’ approach  \n   • Begin with the observation that the midpoint can fall outside the L only in one very specific geometric configuration (one point in the top square and the other in the right square – the two squares that are diagonally opposite in the 2 × 2 board with one square missing).  \n   • Compute  \n     a) the probability of that configuration (2⁄9) and  \n     b) the conditional probability that, given that configuration, the midpoint actually lands outside the L (found to be 1⁄4).  \n   • Multiply and take the complement 1 – (2⁄9·1⁄4) = 17⁄18.  \n   • Add numerators for the contest answer 17 + 18 = 35.  \n   Whether the conditional probability 1⁄4 is obtained by symmetry, by a short integral, or by an averaging argument is regarded as a low-level difference, not a fundamentally new strategy.\n\n2. Any fundamentally different global plan (for instance, working directly with the locus of all midpoints without splitting into cases, using combinatorial area considerations, Monte-Carlo simulation, etc.).\n\nGrouping of the five posted solutions  \nAfter reading all five write-ups, every one of them follows criterion 1. They all:\n\n• notice that only the “opposite-corner squares’’ placement matters,  \n• compute its probability 2⁄9,  \n• find the conditional probability 1⁄4 (by symmetry, integration, or area averaging), and  \n• take the complement.\n\nThere is no solution that deviates from this overarching idea. Therefore they all belong in the same group.\n\nGroup A – “Complement-and-configuration’’ method: Solutions 1, 2, 3, 4, 5.\n\nThere are no other groups, since no solution uses a fundamentally different high-level strategy.",
      "stage2_cates": "{1: \"Solution 1, Solution 2, Solution 3, Solution 4, Solution 5\"}",
      "cats": "[1,1,1,1,1]"
    }
  }
}